# Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0          8.0          6
1          3.0         15
2          6.0          9
3         11.0         19
4         18.0         18

In [9]:
df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00          8.0          6    A
1 2024-10-01 01:00:00          3.0         15    B
2 2024-10-01 02:00:00          6.0          9    C
3 2024-10-01 03:00:00         11.0         19    D
4 2024-10-01 04:00:00         18.0         18    E

In [11]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih Kolom Bertipe Data Numerik

In [14]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          8.0          6
1          3.0         15
2          6.0          9
3         11.0         19
4         18.0         18

In [16]:
df.select_dtypes(include='float')

   bil_pecahan
0          8.0
1          3.0
2          6.0
3         11.0
4         18.0

In [18]:
df.select_dtypes(include='int')

   bil_bulat
0          6
1         15
2          9
3         19
4         18

# Memilih Kolom Bertipe Data String atau Object

In [21]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih Kolom Bertipe Data Datetime

In [24]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

# Memilih Kolom dengan Kombinasi Tipe Data

In [27]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          8.0          6    A
1          3.0         15    B
2          6.0          9    C
3         11.0         19    D
4         18.0         18    E